import { FunctionComponent } from "react";
import Counter from "../defaultPage/components/Counter";
import Counter2 from "../defaultPage/components/Counter2";
import Copyright from "../defaultPage/components/Copyright";
import { useTypedSelector } from "../../hooks/useTypedSelector";
import "../defaultPage/design.css";
import "./About.css"

const About = () => {
  const {user} = useTypedSelector((store: any) => store.UserReducer);
  return (
    <div className="root">
      {(user.role === "User" || user.role === "Admin") ? (
        <Counter2 />
      ) : (
        <Counter />
      )}
        <main className="promotion">
            <section className="frame-parent">
                <div>
                    <p className="g1">Go1Bet — це інноваційна платформа для ставок на спорт і кіберспорт, створена для того, щоб запропонувати вам найкращий досвід гри. 
                    Ми прагнемо забезпечити нашим користувачам доступ до широкого спектра спортивних подій і турнірів із найвигіднішими коефіцієнтами та акціями. Наша мета — зробити кожну ставку захоплюючою та легкою.</p>
                </div>
                <div className="custom-info-about-text">
                    <h2 className="ab1">Що ми пропонуємо:</h2>
                    <p>• <b>Широкий вибір спортивних подій</b>: На Go1Bet ви можете робити ставки на футбол, теніс, баскетбол та багато інших спортивних змагань по всьому світу.</p>
                    <p>• <b>Вигідні коефіцієнти</b>: Ми завжди пропонуємо конкурентні коефіцієнти, що дозволяє вам отримати максимальні виграші за ваші вдалі прогнози.</p>
                    <p>• <b>Зручний інтерфейс</b>: Інтуїтивно зрозумілий інтерфейс платформи дозволяє легко знайти потрібну подію та швидко зробити ставку, навіть якщо ви новачок у ставках.</p>
                    <p>• <b>Безпека та прозорість</b>: Ми використовуємо сучасні технології захисту даних, щоб забезпечити повну безпеку ваших транзакцій і конфіденційність особистої інформації.</p>
                    <p>• <b>Швидке виведення коштів</b>: Go1Bet забезпечує швидку обробку виплат через надійні платіжні системи, щоб ви могли виводити свої виграші без затримок.</p>
                    <p>• <b>Цілодобова підтримка</b>: Наша команда підтримки завжди готова допомогти вам із будь-якими питаннями або проблемами 24/7.</p>

                    
                    <h2 className="ab2">Чому обирають Go1Bet:</h2>
                    <p>• <b>Вигідні коефіцієнти</b>Надійність: Ми діємо в межах законодавства та забезпечуємо чесні і прозорі умови гри.</p>
                    <p>• <b>Вигідні коефіцієнти</b>Акції та бонуси: Ми регулярно проводимо цікаві акції та пропонуємо щедрі бонуси для нових і постійних користувачів.</p>
                    <p>• <b>Відповідальна гра</b>: Ми підтримуємо принципи відповідальної гри та пропонуємо інструменти для контролю над вашою активністю.</p>
                </div>
                <div>
                    <p className="g2">Go1Bet — це не просто платформа для ставок, це місце, де ви можете поєднати свої захоплення спортом і можливість виграшу. 
                    Ми завжди працюємо над тим, щоб зробити ваш досвід ще кращим і більш захоплюючим.</p>
                </div>
                <Copyright />
                <div className="back-to-top">
                    <div className="back-to-top-container">
                    <div className="back-to-top-content">
                        <div className="div">21+</div>
                    </div>
                    <div className="brand-name">
                        <div className="gobet">2024 GO1BET</div>
                    </div>
                    </div>
                </div>
            </section>
      </main>
    </div>
  );
};

export default About;