import { FunctionComponent } from "react";
import Counter from "../defaultPage/components/Counter";
import Counter2 from "../defaultPage/components/Counter2";
import Copyright from "../defaultPage/components/Copyright";
import { useTypedSelector } from "../../hooks/useTypedSelector";
import "../defaultPage/design.css";
import "./General.css"

const General = () => {
  const {user} = useTypedSelector((store: any) => store.UserReducer);
  return (
    <div className="root">
      {(user.role === "User" || user.role === "Admin") ? (
        <Counter2 />
      ) : (
        <Counter />
      )}
        <main className="promotion">
            <section className="frame-parent">
                <div>
                    <p className="g1">Ласкаво просимо на Go1Bet! Перед початком використання нашої платформи, будь ласка, ознайомтесь із загальними правилами. Дотримання цих правил є 
                    обов’язковою умовою для всіх користувачів нашого сайту. </p>
                </div>
                <div className="custom-info-general-text">
                    <h2 className="ab1">Реєстрація та обліковий запис </h2>
                    <p>Користувачам дозволено реєструватися на сайті лише за умови досягнення 21 років для участі в азартних іграх.</p>
                    <p>Під час реєстрації користувач зобов’язаний надавати правдиву та точну інформацію. 
                    В разі виявлення неправдивих даних обліковий запис може бути заблоковано.</p>
                    <p>Реєструючись на платформі Go1Bet, користувач підтверджує, що ознайомлений(-на) та погоджується з договіром оферти, правилами організатора азартних ігор, а також політикою конфіденційності. 
                    Використання сайту означає згоду з цими умовами, і користувач бере на себе відповідальність за їх дотримання.</p>
                    <p>Кожен користувач може мати лише один обліковий запис. 
                    У разі виявлення дублювання акаунтів всі облікові записи можуть бути заблоковані.</p>
                    
                    <h2 className="ab2">Поповнення рахунку та виведення коштів</h2>
                    <p>Для поповнення рахунку користувачі можуть використовувати надані сайтом платіжні системи. 
                    Усі транзакції мають бути легальними та виконаними з облікових записів, які належать користувачеві.</p>
                    <p>Кошти можуть бути виведені лише на ті платіжні методи, які використовувались для поповнення рахунку.</p>
                    <p>Go1Bet залишає за собою право перевіряти дані користувачів перед обробкою запитів на виведення коштів.</p>
                
                    <h2 className="ab3">Ставки та виграші</h2>
                    <p>Користувачі можуть робити ставки на події, доступні на платформі, згідно з поточними коефіцієнтами.</p>
                    <p>Після підтвердження ставки її неможливо скасувати.</p>
                    <p>Виграші нараховуються автоматично після завершення події та підтвердження результатів.</p>
                
                    <h2 className="ab4">Бонуси та акції</h2>
                    <p>Бонуси нараховуються відповідно до умов кожної акційної пропозиції.</p>
                    <p>Всі бонуси мають умови відігравання, які користувач повинен виконати для можливості виведення бонусних коштів.</p>

                    <h2 className="ab5">Безпека та відповідальна гра</h2>
                    <p>Go1Bet серйозно ставиться до захисту персональних даних користувачів і використовує сучасні технології шифрування для забезпечення конфіденційності інформації.</p>
                    <p>Участь в азартних іграх може викликати залежність. Користувачам, які відчувають труднощі з контролем своїх ставок, 
                    рекомендується звернутись за допомогою до спеціалізованих організацій.</p>

                    <h2 className="ab6">Заборонені дії</h2>
                    <p>Забороняється використовувати будь-які автоматизовані системи або програми для розміщення ставок.</p>
                    <p>Забороняється шахрайство, змова або будь-яка інша незаконна діяльність на платформі. 
                    У разі виявлення таких дій обліковий запис буде заблоковано, а кошти можуть бути конфісковані.</p>
                
                    <h1 className="ab7">Закриття або блокування облікового запису</h1>
                    <p>Go1Bet залишає за собою право закрити або заблокувати обліковий запис користувача у разі порушення правил, 
                    а також при підозрі на шахрайство, зловживання бонусними пропозиціями або інші порушення.</p>
                </div>
                <div>
                    <p className="g2">
                    Ці правила розроблені з метою створення справедливого, прозорого та безпечного середовища для всіх користувачів платформи Go1Bet. 
                    Ми прагнемо забезпечити чесну та надійну гру, де кожен користувач може відчувати впевненість у дотриманні законодавчих норм і високих стандартів обслуговування. 
                    Кожен аспект роботи нашого сайту орієнтований на захист прав користувачів, прозорість фінансових операцій, а також запобігання шахрайству та зловживанням.</p>
                </div>
                <Copyright />
                <div className="back-to-top">
                    <div className="back-to-top-container">
                    <div className="back-to-top-content">
                        <div className="div">21+</div>
                    </div>
                    <div className="brand-name">
                        <div className="gobet">2024 GO1BET</div>
                    </div>
                    </div>
                </div>
            </section>
      </main>
    </div>
  );
};

export default General;