import { FunctionComponent } from "react";
import Counter from "../defaultPage/components/Counter";
import Counter2 from "../defaultPage/components/Counter2";
import Copyright from "../defaultPage/components/Copyright";
import { useTypedSelector } from "../../hooks/useTypedSelector";
import "../defaultPage/design.css";
import "./Offer.css"

const Offer = () => {
  const {user} = useTypedSelector((store: any) => store.UserReducer);
  return (
    <div className="root">
      {(user.role === "User" || user.role === "Admin") ? (
        <Counter2 />
      ) : (
        <Counter />
      )}
      <main className="promotion">
            <section className="frame-parent">
                <div>
                    <p className="o1">Даний документ є публічною офертою, яка визначає умови використання онлайн-платформи Go1Bet. 
                    Реєструючись на сайті, користувач автоматично погоджується з усіма положеннями цієї оферти та зобов'язується їх дотримуватись. </p>
                </div>
                <div className="custom-info-offer-text">
                    <h2 className="ab1">Предмет оферти</h2>
                    <p>Платформа Go1Bet надає користувачам можливість здійснювати ставки на спортивні події, кіберспорт та інші заходи, 
                    а також брати участь в азартних іграх на умовах, визначених цим договором. Договір вважається укладеним з моменту реєстрації користувача на платформі 
                    і його згоди з даною офертою.</p>
                    
                    <h2 className="ab2">Акцепт оферти</h2>
                    <p>Реєстрація на сайті Go1Bet є повним і безумовним акцептом цієї публічної оферти. 
                    Відсутність згоди з будь-яким пунктом даного документа позбавляє користувача права користуватись послугами сайту.</p>
                
                    <h2 className="ab3">Права та обов'язки сторін</h2>
                    <p>• <b>Go1Bet</b> зобов'язується надавати користувачам доступ до можливостей платформи, забезпечувати функціонування сайту та відповідність послуг вимогам законодавства.</p>
                    <p>• <b>Користувач</b> зобов’язується дотримуватись правил використання платформи, надавати достовірні особисті дані та дотримуватись умов відповідальної гри.</p>
                
                    <h2 className="ab4">Фінансові операції</h2>
                    <p>Go1Bet надає користувачам можливість здійснювати поповнення рахунку і виведення коштів за допомогою надійних платіжних систем. 
                    Користувач погоджується, що всі фінансові операції є прозорими та виконуються згідно з умовами даної оферти.</p>

                    <h2 className="ab5">Відповідальність сторін</h2>
                    <p>• <b>Go1Bet</b> не несе відповідальності за некоректне використання платформи користувачем, а також за обставини, 
                    що не залежать від організатора (наприклад, технічні збої на стороні платіжних систем або інтернет-провайдерів).</p>
                    <p>• <b>Користувач</b> несе відповідальність за точність наданих даних, законність своїх дій на платформі та дотримання встановлених правил</p>

                    <h2 className="ab6">Внесення змін до оферти</h2>
                    <p>Go1Bet залишає за собою право вносити зміни до даної публічної оферти в будь-який час. Оновлена версія договору набуває чинності з моменту її публікації на сайті. 
                    Користувачі зобов'язані самостійно ознайомлюватися з актуальними версіями документа.</p>
                
                    <h1 className="ab7">Політика конфіденційності</h1>
                    <p>Усі дані, надані користувачами під час реєстрації, зберігаються та обробляються відповідно до політики конфіденційності, яка є невід'ємною частиною цієї оферти.</p>
                
                    <h1 className="ab8">Заключні положення</h1>
                    <p>Дана публічна оферта регулюється відповідно до чинного законодавства. Усі спори, що виникають між Go1Bet та користувачами, вирішуються шляхом переговорів, 
                    а у разі неможливості дійти згоди — у судовому порядку згідно із законодавством.</p>
                </div>
                <div>
                    <p className="o2">
                    Погоджуючись із цією публічною офертою, користувач підтверджує своє ознайомлення з усіма її умовами, правилами організатора азартних ігор, 
                    а також політикою конфіденційності платформи Go1Bet.</p>
                </div>
                <Copyright />
                <div className="back-to-top">
                    <div className="back-to-top-container">
                    <div className="back-to-top-content">
                        <div className="div">21+</div>
                    </div>
                    <div className="brand-name">
                        <div className="gobet">2024 GO1BET</div>
                    </div>
                    </div>
                </div>
            </section>
      </main>
    </div>
  );
};

export default Offer;