import { FunctionComponent } from "react";
import Counter from "../defaultPage/components/Counter";
import Counter2 from "../defaultPage/components/Counter2";
import Copyright from "../defaultPage/components/Copyright";
import { useTypedSelector } from "../../hooks/useTypedSelector";
import "../defaultPage/design.css";
import "./Protection.css"

const Protection = () => {
  const {user} = useTypedSelector((store: any) => store.UserReducer);
  return (
    <div className="root">
      {(user.role === "User" || user.role === "Admin") ? (
        <Counter2 />
      ) : (
        <Counter />
      )}
        <main className="promotion">
            <section className="frame-parent">
                <div>
                    <p className="custom-info-p1">Компанія Go1Bet зобов'язується забезпечувати конфіденційність та захист особистої інформації всіх користувачів нашої платформи. 
                    Ми розуміємо важливість збереження ваших даних у безпеці та вживаємо всіх необхідних заходів для їх захисту. Ця політика захисту інформації описує, які дані ми збираємо, 
                    як ми їх використовуємо, зберігаємо та захищаємо. </p>
                </div>
                <div className="custom-info-protection-text">
                    <h2 className="ab1">Збір інформації</h2>
                    <p>Go1Bet збирає особисті дані, надані користувачами під час реєстрації, поповнення рахунку, участі в ставках та інших взаємодій із сайтом. До цих даних можуть належати:</p>
                    <p>• Повне ім'я;</p>
                    <p>• Адреса електронної пошти;</p>
                    <p>• Номер телефону;</p>
                    <p>• Платіжна інформація (банківські картки, електронні гаманці);</p>
                    <p>• IP-адреса та інші технічні дані про взаємодію з платформою.</p>
                    
                    <h2 className="ab2">Мета збору інформації</h2>
                    <p>Зібрана інформація використовується для:</p>
                    <p>• Реєстрації облікового запису користувача;</p>
                    <p>• Обробки ставок, поповнення рахунку та виведення коштів;</p>
                    <p>• Надання підтримки користувачам;</p>
                    <p>• Підвищення безпеки платформи та захисту від шахрайства.</p>
                    <p>• Дотримання законодавчих вимог і виконання фінансових операцій;</p>
                
                    <h2 className="ab3">Розкриття інформації третім особам</h2>
                    <p>Go1Bet не передає особисті дані користувачів третім особам без попередньої згоди, за винятком таких випадків:</p>
                    <p>• Для виконання законодавчих вимог або на запит державних органів;</p>
                    <p>• Для обробки платежів через надійних платіжних провайдерів;</p>
                    <p>• Для захисту прав і безпеки Go1Bet та користувачів платформи.</p>
                
                    <h2 className="ab4">Збереження даних</h2>
                    <p>Go1Bet зберігає особисті дані користувачів лише протягом часу, необхідного для досягнення цілей, зазначених у цій політиці, 
                    або для виконання вимог законодавства. Після закінчення цього терміну дані будуть видалені або знеособлені.</p>

                    <h2 className="ab5">Права користувачів</h2>
                    <p>Користувачі мають право:</p>
                    <p>• Отримати доступ до своїх особистих даних, збережених на платформі;</p>
                    <p>• Оновлювати або виправляти неточну інформацію;</p>
                    <p>• Вимагати видалення своїх особистих даних (за винятком випадків, коли збереження цих даних є необхідним для виконання законодавчих вимог);</p>
                    <p>• ДВідкликати згоду на обробку персональних даних для маркетингових цілей.</p>

                    <h2 className="ab6">Файли cookie</h2>
                    <p>Go1Bet використовує файли cookie для покращення роботи сайту, персоналізації користувацького досвіду та збереження налаштувань користувача. 
                    Користувачі можуть керувати налаштуваннями cookie або відключати їх у своєму браузері, проте це може вплинути на функціональність сайту.</p>
                </div>
                <div>
                    <p className="custom-info-p2">
                    Go1Bet залишає за собою право змінювати цю політику захисту інформації у будь-який час. 
                    Усі зміни будуть опубліковані на цій сторінці, і користувачі будуть повідомлені про ці зміни. 
                    Продовження використання платформи після змін вважається згодою з оновленою політикою.</p>
                </div>
                <Copyright />
                <div className="back-to-top">
                    <div className="back-to-top-container">
                    <div className="back-to-top-content">
                        <div className="div">21+</div>
                    </div>
                    <div className="brand-name">
                        <div className="gobet">2024 GO1BET</div>
                    </div>
                    </div>
                </div>
            </section>
      </main>
    </div>
  );
};

export default Protection;