import { FunctionComponent } from "react";
import Counter from "../defaultPage/components/Counter";
import Counter2 from "../defaultPage/components/Counter2";
import Copyright from "../defaultPage/components/Copyright";
import { useTypedSelector } from "../../hooks/useTypedSelector";
import "../defaultPage/design.css";
import "./Bonus.css"

const Bonus = () => {
  const {user} = useTypedSelector((store: any) => store.UserReducer);
  return (
    <div className="root">
      {(user.role === "User" || user.role === "Admin") ? (
        <Counter2 />
      ) : (
        <Counter />
      )}
        <main className="promotion">
            <section className="frame-parent">
                <div>
                    <p className="g1">Компанія Go1Bet пропонує своїм користувачам різні бонусні програми та акційні пропозиції, 
                    щоб зробити гру ще цікавішою та вигіднішою. Щоб користуватися бонусами, важливо ознайомитися з умовами їх отримання, 
                    відігравання та використання.</p>
                </div>
                <div className="custom-info-bonus-text">
                    <h2 className="ab1">Загальні умови бонусних пропозицій</h2>
                    <p>• Усі бонуси надаються виключно зареєстрованим користувачам платформи Go1Bet.</p>
                    <p>• Один користувач має право отримати лише один бонус на кожну акцію або пропозицію, якщо інше не зазначено в умовах акції.</p>
                    <p>• Бонуси не можуть бути передані третім особам або іншим акаунтам.</p>
                    
                    <h2 className="ab2"> Види бонусів</h2>
                    <p>• <b>Вітальний бонус</b>: Надається новим користувачам після реєстрації та першого поповнення рахунку. 
                    Умови нарахування можуть включати мінімальний депозит і терміни використання.</p>
                    <p>• <b>Бонус на депозит</b>: Користувачі можуть отримати бонус за поповнення рахунку на певну суму. Розмір бонусу та умови нарахування залежать від акційної пропозиції.</p>
                
                    <h2 className="ab3">Умови відігравання бонусів (вейджер)</h2>
                    <p>• Усі бонуси на сайті Go1Bet мають умови відігравання, тобто необхідно зробити ставки на певну суму перед тим, як бонусні кошти можна буде вивести.</p>
                    <p>• Ставки, зроблені за бонусні кошти, повинні відповідати мінімальним і максимальним ставкам, визначеним в умовах акції.</p>
                
                    <h2 className="ab4">Терміни дії бонусів</h2>
                    <p>• Усі бонуси мають терміни дії, протягом яких вони повинні бути використані. Якщо користувач не встигає виконати умови відігравання 
                    або не використовує бонус у зазначений термін, бонусні кошти будуть анульовані.</p>
                    <p>• Термін дії бонусу зазначається в умовах конкретної акції.</p>

                    <h2 className="ab5">Скасування бонусів</h2>
                    <p>• Go1Bet залишає за собою право скасувати нарахований бонус або змінити його умови, якщо користувач не виконав умов відігравання або виявлені порушення правил використання платформи.</p>
                    <p>• Бонуси можуть бути анульовані, якщо користувач спробував зареєструвати кілька акаунтів для отримання додаткових бонусів або скористався іншими шахрайськими методами.</p>

                    <h2 className="ab6">Важливі застереження</h2>
                    <p>• Усі бонуси на сайті Go1Bet мають бути використані відповідально. Go1Bet закликає користувачів не використовувати бонуси як основний засіб для гри, 
                    а ставитись до них як до додаткового інструменту для розваги.</p>
                    <p>• Go1Bet залишає за собою право змінювати умови будь-яких бонусних програм та акцій. Будь-які зміни будуть опубліковані на сайті, і користувачі будуть повідомлені про них заздалегідь.</p>
                </div>
                <Copyright />
                <div className="back-to-top">
                    <div className="back-to-top-container">
                    <div className="back-to-top-content">
                        <div className="div">21+</div>
                    </div>
                    <div className="brand-name">
                        <div className="gobet">2024 GO1BET</div>
                    </div>
                    </div>
                </div>
            </section>
      </main>
    </div>
  );
};

export default Bonus;